MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX274F256B.PIC
      <edc:DCRDef edc:_addr="0x1FC02FF8" edc:access="------nnnnnnnnnnnnnn-nnnn-n--nnn" edc:cname="DEVCFG1" edc:default="0xffffffff" edc:desc="" edc:impl="0x3fff7a7" edc:name="DEVCFG1" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x3fff7a7">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Selection Bits" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Fast RC Osc (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SPLL" edc:desc="System PLL" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="POSC" edc:desc="Primary Osc (HS,EC, XT)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Low Power Secondary Osc (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Osc (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="FSOSCEN" edc:desc="Secondary Oscillator Enable" edc:mask="0x1" edc:name="FSOSCEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal/External Switch Over" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Configuration" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="External clock mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT osc mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS osc mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Primary osc disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="CLKO Output Signal Active on the OSCO Pin" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPBDIV" edc:desc="Peripheral Clock Divisor" edc:mask="0x3" edc:name="FPBDIV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="Pb_Clk is Sys_Clk/1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="Pb_Clk is Sys_Clk/2" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="Pb_Clk is Sys_Clk/4" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_8" edc:desc="Pb_Clk is Sys_Clk/8" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor Selection" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Clock Switch Enable, FSCM Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock Switch Enable, FSCM Disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Clock Switch Disable, FSCM Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscaler" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTSPGM" edc:desc="Watchdog Timer Stop During Flash Programming" edc:mask="0x1" edc:name="WDTSPGM" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog Timer stops during Flash programming" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog Timer runs during Flash programming" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Watchdog Timer Window Enable" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog Timer is in Window Mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog Timer is in Non-Window Mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT Disabled (SWDTEN Bit Controls)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTWINSZ" edc:desc="Watchdog Timer Window Size" edc:mask="0x3" edc:name="FWDTWINSZ" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="WINSZ_75" edc:desc="Window Size is 75%" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_50" edc:desc="Window Size is 50%" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_37" edc:desc="Window Size is 37.5%" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_25" edc:desc="Window Size is 25%" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC02FFC" edc:access="n--n---nn---nnnnnnnn-------nnnnn" edc:cname="DEVCFG0" edc:default="0x7fffffff" edc:desc="" edc:impl="0x918ff01f" edc:name="DEVCFG0" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x1187f01f">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable" edc:isidehidden="true" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debugger is Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debugger is Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG Port Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="ICE/ICD Comm Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="Communicate on PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx4" edc:desc="Communicate on PGEC4/PGED4" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:DCRFieldDef edc:cname="PWP" edc:desc="Program Flash Write Protect" edc:mask="0xff" edc:name="PWP" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable" edc:when="(field &amp; 0xff) == 0xff"/>
              <edc:DCRFieldSemantic edc:cname="PWP4K" edc:desc="First 4K" edc:when="(field &amp; 0xff) == 0xfe"/>
              <edc:DCRFieldSemantic edc:cname="PWP8K" edc:desc="First 8K" edc:when="(field &amp; 0xff) == 0xfd"/>
              <edc:DCRFieldSemantic edc:cname="PWP12K" edc:desc="First 12K" edc:when="(field &amp; 0xff) == 0xfc"/>
              <edc:DCRFieldSemantic edc:cname="PWP16K" edc:desc="First 16K" edc:when="(field &amp; 0xff) == 0xfb"/>
              <edc:DCRFieldSemantic edc:cname="PWP20K" edc:desc="First 20K" edc:when="(field &amp; 0xff) == 0xfa"/>
              <edc:DCRFieldSemantic edc:cname="PWP24K" edc:desc="First 24K" edc:when="(field &amp; 0xff) == 0xf9"/>
              <edc:DCRFieldSemantic edc:cname="PWP28K" edc:desc="First 28K" edc:when="(field &amp; 0xff) == 0xf8"/>
              <edc:DCRFieldSemantic edc:cname="PWP32K" edc:desc="First 32K" edc:when="(field &amp; 0xff) == 0xf7"/>
              <edc:DCRFieldSemantic edc:cname="PWP36K" edc:desc="First 36K" edc:when="(field &amp; 0xff) == 0xf6"/>
              <edc:DCRFieldSemantic edc:cname="PWP40K" edc:desc="First 40K" edc:when="(field &amp; 0xff) == 0xf5"/>
              <edc:DCRFieldSemantic edc:cname="PWP44K" edc:desc="First 44K" edc:when="(field &amp; 0xff) == 0xf4"/>
              <edc:DCRFieldSemantic edc:cname="PWP48K" edc:desc="First 48K" edc:when="(field &amp; 0xff) == 0xf3"/>
              <edc:DCRFieldSemantic edc:cname="PWP52K" edc:desc="First 52K" edc:when="(field &amp; 0xff) == 0xf2"/>
              <edc:DCRFieldSemantic edc:cname="PWP56K" edc:desc="First 56K" edc:when="(field &amp; 0xff) == 0xf1"/>
              <edc:DCRFieldSemantic edc:cname="PWP60K" edc:desc="First 60K" edc:when="(field &amp; 0xff) == 0xf0"/>
              <edc:DCRFieldSemantic edc:cname="PWP64K" edc:desc="First 64K" edc:when="(field &amp; 0xff) == 0xef"/>
              <edc:DCRFieldSemantic edc:cname="PWP68K" edc:desc="First 68K" edc:when="(field &amp; 0xff) == 0xee"/>
              <edc:DCRFieldSemantic edc:cname="PWP72K" edc:desc="First 72K" edc:when="(field &amp; 0xff) == 0xed"/>
              <edc:DCRFieldSemantic edc:cname="PWP76K" edc:desc="First 76K" edc:when="(field &amp; 0xff) == 0xec"/>
              <edc:DCRFieldSemantic edc:cname="PWP80K" edc:desc="First 80K" edc:when="(field &amp; 0xff) == 0xeb"/>
              <edc:DCRFieldSemantic edc:cname="PWP84K" edc:desc="First 84K" edc:when="(field &amp; 0xff) == 0xea"/>
              <edc:DCRFieldSemantic edc:cname="PWP88K" edc:desc="First 88K" edc:when="(field &amp; 0xff) == 0xe9"/>
              <edc:DCRFieldSemantic edc:cname="PWP92K" edc:desc="First 92K" edc:when="(field &amp; 0xff) == 0xe8"/>
              <edc:DCRFieldSemantic edc:cname="PWP96K" edc:desc="First 96K" edc:when="(field &amp; 0xff) == 0xe7"/>
              <edc:DCRFieldSemantic edc:cname="PWP100K" edc:desc="First 100K" edc:when="(field &amp; 0xff) == 0xe6"/>
              <edc:DCRFieldSemantic edc:cname="PWP104K" edc:desc="First 104K" edc:when="(field &amp; 0xff) == 0xe5"/>
              <edc:DCRFieldSemantic edc:cname="PWP108K" edc:desc="First 108K" edc:when="(field &amp; 0xff) == 0xe4"/>
              <edc:DCRFieldSemantic edc:cname="PWP112K" edc:desc="First 112K" edc:when="(field &amp; 0xff) == 0xe3"/>
              <edc:DCRFieldSemantic edc:cname="PWP116K" edc:desc="First 116K" edc:when="(field &amp; 0xff) == 0xe2"/>
              <edc:DCRFieldSemantic edc:cname="PWP120K" edc:desc="First 120K" edc:when="(field &amp; 0xff) == 0xe1"/>
              <edc:DCRFieldSemantic edc:cname="PWP124K" edc:desc="First 124K" edc:when="(field &amp; 0xff) == 0xe0"/>
              <edc:DCRFieldSemantic edc:cname="PWP128K" edc:desc="First 128K" edc:when="(field &amp; 0xff) == 0xdf"/>
              <edc:DCRFieldSemantic edc:cname="PWP132K" edc:desc="First 132K" edc:when="(field &amp; 0xff) == 0xde"/>
              <edc:DCRFieldSemantic edc:cname="PWP136K" edc:desc="First 136K" edc:when="(field &amp; 0xff) == 0xdd"/>
              <edc:DCRFieldSemantic edc:cname="PWP140K" edc:desc="First 140K" edc:when="(field &amp; 0xff) == 0xdc"/>
              <edc:DCRFieldSemantic edc:cname="PWP144K" edc:desc="First 144K" edc:when="(field &amp; 0xff) == 0xdb"/>
              <edc:DCRFieldSemantic edc:cname="PWP148K" edc:desc="First 148K" edc:when="(field &amp; 0xff) == 0xda"/>
              <edc:DCRFieldSemantic edc:cname="PWP152K" edc:desc="First 152K" edc:when="(field &amp; 0xff) == 0xd9"/>
              <edc:DCRFieldSemantic edc:cname="PWP156K" edc:desc="First 156K" edc:when="(field &amp; 0xff) == 0xd8"/>
              <edc:DCRFieldSemantic edc:cname="PWP160K" edc:desc="First 160K" edc:when="(field &amp; 0xff) == 0xd7"/>
              <edc:DCRFieldSemantic edc:cname="PWP164K" edc:desc="First 164K" edc:when="(field &amp; 0xff) == 0xd6"/>
              <edc:DCRFieldSemantic edc:cname="PWP168K" edc:desc="First 168K" edc:when="(field &amp; 0xff) == 0xd5"/>
              <edc:DCRFieldSemantic edc:cname="PWP172K" edc:desc="First 172K" edc:when="(field &amp; 0xff) == 0xd4"/>
              <edc:DCRFieldSemantic edc:cname="PWP176K" edc:desc="First 176K" edc:when="(field &amp; 0xff) == 0xd3"/>
              <edc:DCRFieldSemantic edc:cname="PWP180K" edc:desc="First 180K" edc:when="(field &amp; 0xff) == 0xd2"/>
              <edc:DCRFieldSemantic edc:cname="PWP184K" edc:desc="First 184K" edc:when="(field &amp; 0xff) == 0xd1"/>
              <edc:DCRFieldSemantic edc:cname="PWP188K" edc:desc="First 188K" edc:when="(field &amp; 0xff) == 0xd0"/>
              <edc:DCRFieldSemantic edc:cname="PWP192K" edc:desc="First 192K" edc:when="(field &amp; 0xff) == 0xcf"/>
              <edc:DCRFieldSemantic edc:cname="PWP196K" edc:desc="First 196K" edc:when="(field &amp; 0xff) == 0xce"/>
              <edc:DCRFieldSemantic edc:cname="PWP200K" edc:desc="First 200K" edc:when="(field &amp; 0xff) == 0xcd"/>
              <edc:DCRFieldSemantic edc:cname="PWP204K" edc:desc="First 204K" edc:when="(field &amp; 0xff) == 0xcc"/>
              <edc:DCRFieldSemantic edc:cname="PWP208K" edc:desc="First 208K" edc:when="(field &amp; 0xff) == 0xcb"/>
              <edc:DCRFieldSemantic edc:cname="PWP212K" edc:desc="First 212K" edc:when="(field &amp; 0xff) == 0xca"/>
              <edc:DCRFieldSemantic edc:cname="PWP216K" edc:desc="First 216K" edc:when="(field &amp; 0xff) == 0xc9"/>
              <edc:DCRFieldSemantic edc:cname="PWP220K" edc:desc="First 220K" edc:when="(field &amp; 0xff) == 0xc8"/>
              <edc:DCRFieldSemantic edc:cname="PWP224K" edc:desc="First 224K" edc:when="(field &amp; 0xff) == 0xc7"/>
              <edc:DCRFieldSemantic edc:cname="PWP228K" edc:desc="First 228K" edc:when="(field &amp; 0xff) == 0xc6"/>
              <edc:DCRFieldSemantic edc:cname="PWP232K" edc:desc="First 232K" edc:when="(field &amp; 0xff) == 0xc5"/>
              <edc:DCRFieldSemantic edc:cname="PWP236K" edc:desc="First 236K" edc:when="(field &amp; 0xff) == 0xc4"/>
              <edc:DCRFieldSemantic edc:cname="PWP240K" edc:desc="First 240K" edc:when="(field &amp; 0xff) == 0xc3"/>
              <edc:DCRFieldSemantic edc:cname="PWP244K" edc:desc="First 244K" edc:when="(field &amp; 0xff) == 0xc2"/>
              <edc:DCRFieldSemantic edc:cname="PWP248K" edc:desc="First 248K" edc:when="(field &amp; 0xff) == 0xc1"/>
              <edc:DCRFieldSemantic edc:cname="PWP252K" edc:desc="First 252K" edc:when="(field &amp; 0xff) == 0xc0"/>
              <edc:DCRFieldSemantic edc:cname="PWP256K" edc:desc="First 256K" edc:when="(field &amp; 0xff) == 0xbf"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="SMCLR" edc:desc="Soft Master Clear Enable" edc:mask="0x1" edc:name="SMCLR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MCLR_POR" edc:desc="MCLR pin generates an emulated POR Reset" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MCLR_NORM" edc:desc="MCLR pin generates a normal system Reset" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BWP" edc:desc="Boot Flash Write Protect bit" edc:mask="0x1" edc:name="BWP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x1d000000" edc:checksumalgo="0x80" edc:endaddr="0x1d07ffff"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x00" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x10000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:kuseg="0x7f000000" edc:regionid="kseg1_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f80a400" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="1" edc:access="----------------n-nn---n-----nnn" edc:cname="DSCON" edc:desc="" edc:impl="0xb107" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-00---0-----000" edc:name="DSCON" edc:nzwidth="32" edc:por="----------------0-00---0-----000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RELEASE" edc:desc="" edc:mask="0x1" edc:name="RELEASE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DSBOR" edc:desc="" edc:mask="0x1" edc:name="DSBOR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WAKEDIS" edc:desc="" edc:mask="0x1" edc:name="WAKEDIS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RTCCWDIS" edc:desc="" edc:mask="0x1" edc:name="RTCCWDIS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RTCDIS" edc:desc="" edc:mask="0x1" edc:name="DSGPREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DSGPREN" edc:desc="" edc:mask="0x1" edc:name="DSGPREN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DSEN" edc:desc="" edc:mask="0x1" edc:name="DSEN" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
