MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX274F256B.PIC
      <edc:AdjustPoint edc:_addr="0x1F80F0A0" edc:offset="0x60"/>
      <edc:SFRDef edc:_addr="0x1F80F100" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-03100_clk_cru_upb_v3_32bit.Module" edc:_refcount="3" edc:access="----------------n---r----nnnnnnn" edc:cname="PB1DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB1DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80F110" edc:offset="0xc0"/>
      <edc:SFRDef edc:_addr="0x1F80F1D0" edc:_begin="0xd0" edc:_end="0xe0" edc:_modsrc="DOS-03100_clk_cru_upb_v3_32bit_TQAJ.Module" edc:_refcount="2" edc:access="------------------------r-rr-rnr" edc:cname="CLKSTAT" edc:desc="" edc:impl="0xb7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------u-uu-uuu" edc:name="CLKSTAT" edc:nzwidth="32" edc:por="------------------------0-00-0x0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRCRDY" edc:mask="0x1" edc:name="FRCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDIVRDY" edc:mask="0x1" edc:name="SPDIVRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSCRDY" edc:mask="0x1" edc:name="POSCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SOSCRDY" edc:mask="0x1" edc:name="SOSCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRCRDY" edc:mask="0x1" edc:name="LPRCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLRDY" edc:mask="0x1" edc:name="SPLLRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLRDY" edc:mask="0x1" edc:name="UPLLRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSPLLRDY" edc:mask="0x1" edc:name="DIVSPLLRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80F1E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F80F200" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-02912_TQAJ_Config .Module" edc:_refcount="1" edc:access="------------------nn--------n--n" edc:cname="CFGCON" edc:desc="" edc:grp="CFG" edc:impl="0x3009" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00--------1--0" edc:name="CFGCON" edc:nzwidth="32" edc:por="------------------00--------1--0" edc:portals="- - -" ltx:baseofperipheral="CFG">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="DDPCON"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TDOEN" edc:desc="" edc:mask="0x1" edc:name="TDOEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FAEN" edc:desc="" edc:mask="0x1" edc:name="FAEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:desc="" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RPFA" edc:desc="" edc:mask="0x1" edc:name="RPFA" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:desc="" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="18"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80F210" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F80F220" edc:_begin="0x20" edc:_end="0xa0" edc:_modsrc="DOS-02912_TQAJ_Config .Module" edc:_refcount="2" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:desc="" edc:grp="CFG" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DEVID" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEVID" edc:desc="" edc:mask="0xfffffff" edc:name="DEVID" edc:nzwidth="0x1c"/>
            <edc:SFRFieldDef edc:cname="VER" edc:desc="" edc:mask="0x1" edc:name="VER" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F230" edc:_begin="0x20" edc:_end="0xa0" edc:_modsrc="DOS-02912_TQAJ_Config .Module" edc:_refcount="2" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr-r" edc:cname="SYSKEY" edc:desc="" edc:grp="CFG" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="SYSKEY" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYSKEY" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="SYSKEY" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F240" edc:_begin="0x20" edc:_end="0xa0" edc:_modsrc="DOS-02912_TQAJ_Config .Module" edc:_refcount="2" edc:access="---------------n---n---n-------n" edc:cname="PMD1" edc:desc="" edc:grp="CFG" edc:impl="0x1101" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0---0---0-------0" edc:name="PMD1" edc:nzwidth="0x20" edc:por="-------------------0---0-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1MD" edc:desc="" edc:mask="0x1" edc:name="AD1MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CVRMD" edc:desc="" edc:mask="0x1" edc:name="CVRMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="HLVDMD" edc:desc="" edc:mask="0x1" edc:name="CVRMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F250" edc:_begin="0x20" edc:_end="0xa0" edc:_modsrc="DOS-02912_TQAJ_Config .Module" edc:_refcount="2" edc:access="-----------------------------nnn" edc:cname="PMD2" edc:desc="" edc:grp="CFG" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------------000" edc:name="PMD2" edc:nzwidth="0x20" edc:por="-----------------------------000" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP3MD" edc:desc="" edc:mask="0x1" edc:name="CMP3MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="19"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F260" edc:_begin="0x20" edc:_end="0xa0" edc:_modsrc="DOS-02912_TQAJ_Config .Module" edc:_refcount="2" edc:access="-----------nnnnn-----------nnnnn" edc:cname="PMD3" edc:desc="" edc:grp="CFG" edc:impl="0x1f001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000-----------00000" edc:name="PMD3" edc:nzwidth="0x20" edc:por="-----------00000-----------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3MD" edc:desc="" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4MD" edc:desc="" edc:mask="0x1" edc:name="IC4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5MD" edc:desc="" edc:mask="0x1" edc:name="IC5MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5MD" edc:desc="" edc:mask="0x1" edc:name="OC5MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
